In [1]:
import pandas as pd

In [2]:
revenues = pd.Series([
    5555, 
    7000, 
    1980])
revenues

0    5555
1    7000
2    1980
dtype: int64

revenues.values

In [3]:
revenues.values

array([5555, 7000, 1980])

In [4]:
revenues.index

RangeIndex(start=0, stop=3, step=1)

In [5]:
city_revenues = pd.Series(
    [4200, 8000, 6500], 
    index=["Amsterdam", "Toronto", "Tokyo"])
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [6]:
city_employee_count = pd.Series({"Amsterdam": 5, "Tokyo": 8})

In [7]:
city_employee_count

Amsterdam    5
Tokyo        8
dtype: int64

In [8]:
city_employee_count.keys()

Index(['Amsterdam', 'Tokyo'], dtype='object')

In [9]:
"Tokyo" in city_employee_count

True

In [10]:
"New York" in city_employee_count

False

In [11]:
city_data = pd.DataFrame({"revenue": city_revenues,"employee_count": city_employee_count})

In [12]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [13]:
city_data.index

Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object')

In [14]:
city_data.values

array([[4.2e+03, 5.0e+00],
       [6.5e+03, 8.0e+00],
       [8.0e+03,     nan]])

In [15]:
city_data.axes

[Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object'),
 Index(['revenue', 'employee_count'], dtype='object')]

In [16]:
city_data.axes[0]

Index(['Amsterdam', 'Tokyo', 'Toronto'], dtype='object')

In [17]:
city_data.axes[1]

Index(['revenue', 'employee_count'], dtype='object')

In [20]:
city_revenues

Amsterdam    4200
Toronto      8000
Tokyo        6500
dtype: int64

In [21]:
city_revenues["Toronto"]

8000

In [22]:
city_revenues[1]

8000

In [23]:
city_revenues[-1]

6500

In [24]:
city_revenues[1:]

Toronto    8000
Tokyo      6500
dtype: int64

In [25]:
city_revenues["Toronto":]

Toronto    8000
Tokyo      6500
dtype: int64

In [26]:
colors = pd.Series(
    ["red", "purple", "blue", "green", "yellow"], 
    index=[1, 2, 3, 5, 8])
colors

1       red
2    purple
3      blue
5     green
8    yellow
dtype: object

In [27]:
colors[1]

'red'

In [28]:
colors.loc[1]

'red'

In [29]:
colors.iloc[1]

'purple'

In [30]:
colors.iloc[1:3]

2    purple
3      blue
dtype: object

In [31]:
colors.loc[1:3]

1       red
2    purple
3      blue
dtype: object

In [32]:
colors.loc[3:8]

3      blue
5     green
8    yellow
dtype: object

In [33]:
colors.loc[2:6]

2    purple
3      blue
5     green
dtype: object

In [34]:
colors.iloc[-4]

'purple'

In [35]:
city_data["revenue"]

Amsterdam    4200
Tokyo        6500
Toronto      8000
Name: revenue, dtype: int64

In [36]:
type(city_data["revenue"])

pandas.core.series.Series

In [37]:
toys = pd.DataFrame([
    {"name": "ball", "shape": "sphere"},
    {"name": "Rubik's cube", "shape": "cube"}])

In [38]:
toys["shape"]

0    sphere
1      cube
Name: shape, dtype: object

In [39]:
toys.shape

(2, 2)

In [40]:
city_data.loc["Amsterdam"]

revenue           4200.0
employee_count       5.0
Name: Amsterdam, dtype: float64

In [41]:
city_data.loc["Tokyo": "Toronto"]

         revenue  employee_count
Tokyo       6500             8.0
Toronto     8000             NaN

In [42]:
city_data.iloc[1]

revenue           6500.0
employee_count       8.0
Name: Tokyo, dtype: float64

In [44]:
city_revenues.sum()

18700

In [45]:
city_revenues.max()

8000

In [46]:
city_revenues.min()

4200

In [47]:
city_revenues.mean()

6233.333333333333

In [49]:
city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN

In [51]:
further_city_data = pd.DataFrame(
    {"revenue": [7000, 3400], "employee_count":[2, 2]},
    index=["New York", "Barcelona"]
)

In [52]:
all_city_data = pd.concat([city_data, further_city_data], sort=False)

In [53]:
all_city_data

           revenue  employee_count
Amsterdam     4200             5.0
Tokyo         6500             8.0
Toronto       8000             NaN
New York      7000             2.0
Barcelona     3400             2.0

In [54]:
city_countries = pd.DataFrame({
    'country': ['Holland', 'Japan', 'Holland', 'Canada', 'Spain'],
    'capital': [1, 1, 0, 0, 0]
}, index=['Amsterdam', 'Tokyo', 'Rotterdam', 'Toronto', 'Barcelona'])

In [56]:
cities = pd.concat([all_city_data, city_countries], axis=1, sort=False, join='inner')
cities

           revenue  employee_count  country  capital
Amsterdam     4200             5.0  Holland        1
Tokyo         6500             8.0    Japan        1
Toronto       8000             NaN   Canada        0
Barcelona     3400             2.0    Spain        0

In [57]:
countries = pd.DataFrame({
    'population_millions': [17, 127, 37],
    'continent': ['Europe', 'Asia', 'North America']
}, index=['Holland', 'Japan', 'Canada'])

In [58]:
pd.merge(cities, countries, left_on='country', right_index=True)

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,4200,5.0,Holland,1,17,Europe
Tokyo,6500,8.0,Japan,1,127,Asia
Toronto,8000,NaN,Canada,0,37,North America

In [59]:
pd.merge(cities, countries, left_on='country', right_index=True, how='left')

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,4200,5.0,Holland,1,17.0,Europe
Tokyo,6500,8.0,Japan,1,127.0,Asia
Toronto,8000,NaN,Canada,0,37.0,North America
Barcelona,3400,2.0,Spain,0,NaN,NaN

In [60]:
countries

         population_millions      continent
Holland                   17         Europe
Japan                    127           Asia
Canada                    37  North America